# -*- coding: utf-8 -*-
"""Лабораторная работа № 1 ,Мырша Дмитрий

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1bmxydQQphbctjX8Xn6wtIysmKtxehVMl
"""

a = int(input())
b = int(input())
# c = int(input())
res = a**2 + 2*a*b + b**2
print(res)

a = int(input())
b = int(input())
# c = int(input())
res = (a+b)**2
print("Result = ", res)

a = 15
b = 10
c = int(input())
res = (a+b)/c
print(res)

a = int(input())
b = int(input())
c = int(input())
if (a == b or a == c or b == c):
    print("Введи разные стороны!!!!!!!!!!!")
else:
    p = (a+b+c)/2
    S = (p*(p-a)*(p-b)*(p-c))**0.5
    res = S
    print(res)

a = int(input())
b = int(input())
# c = int(input())
res = ((a**3 + 14)/5)*b
print(res)\

a = int(input())
b = int(input())
c = a**2
res = c//b
print(res)

a1 = float(input())
b1 = float(input())

a2 = int(input())
b2 = int(input())

a3 = int(input())
b3 = int(input())
if (a2<=0 or b2<=0 or a3<=0 or b3<=0):
    print("Ты знаешь, что такое натуральные числа???????????????????!!!!!!!!!!!!!!!!!!!")
else:
  res1 = a1//b1
  res2 = a2*b2
  res3=a3%b3
  print("деления двух дробных чисел без остатка:", res1)
  print("умножения двух натуральных чисел:", res2)
  print("получение остатка от деления двух натуральных чисел:", res3)

# Задача повышенной сложности:
# 1. Пользователь вводит число секунд равное n. Рассчитайте сколько дней/часов/минут в введённом количестве секунд.

# 2. При заданном целом числе n посчитайте n + nn + nnn.

# После выполнения всех заданий вам необходимо поделиться ссылкой на свой блокнот с преподавателем, это делается при помощи кнопки “поделиться” в верхней правой части экрана вашей среды выполнения.
# (не забудьте открыть доступ к своему блокноту для всех пользователей у которых есть ссылка)

n = int(input())
SM = n//60
SC = n//3600
SD = n//216000

print("Kol-vo sekund = ", n)
print("Kol-vo minut = ", SM)
print("Kol-vo casov = ", SC)
print("Kol-vo dnej = ", SD)

m = str(n)
i = m+m
j=m+m+m
p2 = int(i)
p3 = int(j)
print("n + nn + nnn:", m, " + ", i, " + ", j, " = ", n + p2 + p3)